gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */

static ble_pbs_t                         m_pbs;                                     /**< Structure used to identify the PBS. */
//static ble_bas_t                         m_bas;                                     /**< Structure used to identify the battery service. */
//static ble_hrs_t                         m_hrs;                                     /**< Structure used to identify the heart rate service. */
//static bool                              m_rr_interval_enabled = true;              /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

//static sensorsim_cfg_t                   m_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
//static sensorsim_state_t                 m_battery_sim_state;                       /**< Battery Level sensor simulator state. */
//static sensorsim_cfg_t                   m_heart_rate_sim_cfg;                      /**< Heart Rate sensor simulator configuration. */
//static sensorsim_state_t                 m_heart_rate_sim_state;                    /**< Heart Rate sensor simulator state. */
//static sensorsim_cfg_t                   m_rr_interval_sim_cfg;                     /**< RR Interval sensor simulator configuration. */
//static sensorsim_state_t                 m_rr_interval_sim_state;                   /**< RR Interval sensor simulator state. */

APP_TIMER_DEF(m_cal_data_id);                                                  /**< Battery timer. */
APP_TIMER_DEF(m_adv_timer_id);                                               /**< Heart rate measurement timer. */
//APP_TIMER_DEF(m_rr_interval_timer_id);                                              /**< RR interval timer. */                 /**< RR interval timer. */
//APP_TIMER_DEF(m_sensor_contact_timer_id);                                           /**< Sensor contact detected timer. */

extern bool esc_notify_flag;
extern bool start_dw_flag;
extern bool drhc_notify_flag;
extern bool cdrc_notify_flag;
extern bool rdrc_notify_flag;
static dm_application_instance_t         m_app_handle;                              /**< Application identifier allocated by device manager */
static bool data_process_trigger = false;
static bool advertising_trigger = false;
//static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE}};
                                   //{BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE}};
                                   //{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */
#define PBS_SERVICE_SHORT_UUID 										0x2FE0
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_ALERT_NOTIFICATION_SERVICE,         BLE_UUID_TYPE_BLE}};
#ifdef BLE_DFU_APP_SUPPORT
static ble_dfu_t                         m_dfus;                                    /**< Structure used to identify the DFU service. */
#endif // BLE_DFU_APP_SUPPORT

//Gill Add 20160314
#define MAIN_DEBUG											1 
#define PBS_SERVICE_SHORT_UUID 										0x2FE0


static uint16_t pktCounter = 0; // need change to variable
static uint16_t pktCounterCopy;
static uint16_t adv_counter = 0;
static bool 		adv_on = false;
static uint16_t totalPktNum;
static uint8_t p_cal_encoded_buffer_prepare[20] = {0};
																	 
/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
//static void battery_level_update(void)
//{
//    uint32_t err_code;
//    uint8_t  battery_level;

//    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

//    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
//    if ((err_code != NRF_SUCCESS) &&
//        (err_code != NRF_ERROR_INVALID_STATE) &&
//        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
//        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//        )
//    {
//        APP_ERROR_HANDLER(err_code);
//    }
//}

void flash_write_simulation(void)
{
	float cal_acc_test[3];	
		cal_acc_test[0] = 0.5;
		cal_acc_test[1] = 0.1;
		cal_acc_test[2] = 0.2;			
		int w_cnt = 600 * 3;
	//	flash_data_set_init();	
		while(w_cnt--) {
				if (w_cnt == 1000) {
					flash_data_set_write(NULL, cal_acc_test, 1);
				} else if (w_cnt == 500) {
					flash_data_set_write(NULL, cal_acc_test, 2);
				}	else {
					flash_data_set_write(NULL, cal_acc_test,0);
				}	
		}
		//nrf_delay_ms(20);
		pktCounter = 125;
//		m_pbs.esc_s.number_of_event = 1;
//		uint8_t esc_sim_data[3] = {0,0,1};
//		ble_pbs_esc_update(&m_pbs, esc_sim_data);
		printf("flash write simulation\r\n");
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void cal_data_timeout_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);
	data_process_trigger = true;
}

static void data_process(void)
{
    if (data_process_trigger)
	{
		data_process_trigger = false;
		uint32_t err_code;
	
	if (pktCounter == 0)
	{
//		flash_write_simulation();
	}
	// Simulator flash read
		uint16_t data_x[4] = {0};
		uint16_t data_y[4] = {0};
		uint16_t data_z[4] = {0};
		//uint8_t len = 0;
		uint8_t p_cal_encoded_buffer[20] = {0};
		
		//uint32_t err_code;
#if FLASH_READ	
		uint32_t r_xy;
		uint32_t r_z;
		uint8_t r_event_ID;
		uint32_t r_UTC;
		uint32_t cal_r_xy;
		uint32_t cal_r_z;
		uint8_t r_sensor_interval;	
		int ret=-1;
		ret = flash_data_set_read(&r_xy, &r_z, &cal_r_xy, &cal_r_z, &r_event_ID, &r_UTC, &r_sensor_interval);
		//nrf_delay_ms(100);
		// UART Print
		if (ret >= 0) {
				
				printf("%i,%u,", r_event_ID, r_UTC);
			//print logged raw xyz data
			printf("%i,%f,%f,%f\n\r", ret+1,(float)((cal_r_xy&0xFFFF0000)>>16)/100-16,(float)(cal_r_xy&0x0000FFFF)/100-16, (float)cal_r_z/100-16);
		} else{
			//printf("no event;");
		}
		uint8_t pktNum=0; //for 4 packet in one notify
		
		if (ret > 0 && m_conn_handle != BLE_CONN_HANDLE_INVALID && cdrc_notify_flag== true)  // for test
		{
			// need change
			//totalPktNum = (m_pbs.bsc_s.sampling_frequency)*(m_pbs.drhc_s.recorded_event_duration);
//			if (ret == 499) 
//			{
//				pktCounter = 125; 
//			}
			// Send Data Header
			pktCounter = (ret+1)/4;
			printf("pktCounter : %i ",pktCounter);
			pktCounterCopy = pktCounter;
			if ((pktCounter > pktCounterCopy) || pktCounter == 125)
			{
				uint32_t tempUTC = UTC_get();
				uint8_t p_tempUTC[4]; 
				uint32_big_encode(tempUTC,p_tempUTC);
				uint8_t sim_drhc_data[14] = {20,12,3,r_event_ID,10,p_tempUTC[0],p_tempUTC[1],p_tempUTC[2],p_tempUTC[3],0,0,0,0,0};
				//uint8_t sim_drhc_data[9] = {20,12,3,1,10,0,0,0,0};
				err_code = ble_pbs_drhc_update(&m_pbs, sim_drhc_data);
				printf("drhc_update:%04X\r\n",err_code);
			}
			
