gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
			p_cal_encoded_buffer[0] = pktCounter;
			p_cal_encoded_buffer[1] = 18;
			
			pktCounter--;
			// Flash data assign to uint16_t array
			for (int i=0;i<4;i++)
			{
				data_x[i] = (uint16_t)((cal_r_xy&0xFFFF0000)>>16);
				data_y[i] = (uint16_t)(cal_r_xy&0xFFFF);
				data_z[i] = (uint16_t)(cal_r_z&0xFFFF);
				if (i!= 0)
					ret = flash_data_set_read(&r_xy, &r_z, &cal_r_xy, &cal_r_z, &r_event_ID, &r_UTC, &r_sensor_interval);
			}
				// Check data 
			for(int i=0;i<4;i++)
			{
				printf("%04X %04X %04X ",data_x[i],data_y[i],data_z[i]);
			}
			printf("\r\n");
			pktNum=0;
			// assign 4 read data value to cdrc data packet
			for (int i=2;i<20;i=i+9)
			{
				p_cal_encoded_buffer[i] = (uint8_t) (data_z[pktNum]& 0xFF) ;
				p_cal_encoded_buffer[i+1] = ((data_z[pktNum]& 0x0F00) >> 8) | ((data_y[pktNum]&0x0F) << 4);
				p_cal_encoded_buffer[i+2] = (uint8_t) ((data_y[pktNum]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+3] = (uint8_t) (data_x[pktNum]& 0xFF)  ;
				p_cal_encoded_buffer[i+4] = ((data_x[pktNum]& 0x0F00) >> 8) | ((data_z[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+5] = (uint8_t) ((data_z[pktNum+1]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+6] = (uint8_t) (data_y[pktNum+1]& 0xFF) ;
				p_cal_encoded_buffer[i+7] = ((data_y[pktNum+1]& 0x0F00) >> 8) | ((data_x[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+8] = (uint8_t) ((data_x[pktNum+1]& 0x0FF0) >> 4) ;
				pktNum += 2;
			}
			printf("ret: %i,Cal data:",ret);
			for(int i=19;i>=0;i--)
			{
				printf("%02X",p_cal_encoded_buffer[i]);
			}
			printf("\r\n");
			// Check Flash data read error
			if (p_cal_encoded_buffer[19]==0xFF &&p_cal_encoded_buffer[18]==0xFF&&p_cal_encoded_buffer[17]==0xFF && p_cal_encoded_buffer[16]==0xFF)
			{
					for(int i=19;i>=2;i--)
					{
						p_cal_encoded_buffer[i] = p_cal_encoded_buffer_prepare[i];
					}
			}
			err_code = ble_pbs_cdrc_update(&m_pbs, p_cal_encoded_buffer);
			printf("cdrc_update_err:%04X\r\n",err_code);
			
			//Prepare for flash read error
			for(int i=19;i>=2;i--)
			{
				p_cal_encoded_buffer_prepare[i] = p_cal_encoded_buffer[i];
			}
		}
#endif
	} // if(ble_routine_trigger)
}

//static void battery_level_meas_timeout_handler(void * p_context)
//{
//    UNUSED_PARAMETER(p_context);
//    battery_level_update();
//}


/**@brief Function for handling the Heart rate measurement timer timeout.
 *
 * @details This function will be called each time the heart rate measurement timer expires.
 *          It will exclude RR Interval data from every third measurement.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void advertising_duration_handle(void)
{
	if (advertising_trigger)
	{
		advertising_trigger = false;
		uint32_t err_code;
		adv_counter--;
		if (adv_counter==0 && adv_on == true)
		{
			sd_ble_gap_adv_stop();
			printf("adv_stop;adv_counter:%i\r\n",adv_counter);
			adv_counter = ADV_STOP_DURATION/ADVERTISING_TIMER_DURATION;
			adv_on = false;
		}
		else if (adv_counter == 0 && adv_on == false)
		{
			err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
			printf("adv_start;adv_err:%04X\r\n",err_code);
			adv_counter = ADV_DURATION/ADVERTISING_TIMER_DURATION;
			adv_on = true;
		}
  }
}
static void adv_timeout_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);
	// For advertising
	//advertising_trigger = true;
}



//static void heart_rate_meas_timeout_handler(void * p_context)
//{
//    static uint32_t cnt = 0;
//    uint32_t        err_code;
//    uint16_t        heart_rate;

//    UNUSED_PARAMETER(p_context);

//    heart_rate = (uint16_t)sensorsim_measure(&m_heart_rate_sim_state, &m_heart_rate_sim_cfg);

//    cnt++;
//    err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, heart_rate);
//    if ((err_code != NRF_SUCCESS) &&
//        (err_code != NRF_ERROR_INVALID_STATE) &&
//        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
//        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//        )
//    {
//        APP_ERROR_HANDLER(err_code);
//    }

//    // Disable RR Interval recording every third heart rate measurement.
//    // NOTE: An application will normally not do this. It is done here just for testing generation
//    //       of messages without RR Interval measurements.
//    m_rr_interval_enabled = ((cnt % 3) != 0);
//}


/**@brief Function for handling the RR interval timer timeout.
 *
 * @details This function will be called each time the RR interval timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
//static void rr_interval_timeout_handler(void * p_context)
//{
//    UNUSED_PARAMETER(p_context);

//    if (m_rr_interval_enabled)
//    {
//        uint16_t rr_interval;

//        rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
//                                                      &m_rr_interval_sim_cfg);
//        ble_hrs_rr_interval_add(&m_hrs, rr_interval);
//    }
//}


/**@brief Function for handling the Sensor Contact Detected timer timeout.
 *
 * @details This function will be called each time the Sensor Contact Detected timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
//static void sensor_contact_detected_timeout_handler(void * p_context)
//{
//    static bool sensor_contact_detected = false;

//    UNUSED_PARAMETER(p_context);

//    sensor_contact_detected = !sensor_contact_detected;
//    ble_hrs_sensor_contact_detected_update(&m_hrs, sensor_contact_detected);
//}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.

