gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
    err_code = app_timer_create(&m_cal_data_id,
                                APP_TIMER_MODE_REPEATED,
                                cal_data_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_adv_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                adv_timeout_handler);
    APP_ERROR_CHECK(err_code);

//    err_code = app_timer_create(&m_rr_interval_timer_id,
//                                APP_TIMER_MODE_REPEATED,
//                                rr_interval_timeout_handler);
//    APP_ERROR_CHECK(err_code);

//    err_code = app_timer_create(&m_sensor_contact_timer_id,
//                                APP_TIMER_MODE_REPEATED,
//                                sensor_contact_detected_timeout_handler);
//    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_UNKNOWN);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


#ifdef BLE_DFU_APP_SUPPORT
/**@brief Function for stopping advertising.
 */
static void advertising_stop(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_stop();
    APP_ERROR_CHECK(err_code);

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for loading application-specific context after establishing a secure connection.
 *
 * @details This function will load the application context and check if the ATT table is marked as
 *          changed. If the ATT table is marked as changed, a Service Changed Indication
 *          is sent to the peer if the Service Changed CCCD is set to indicate.
 *
 * @param[in] p_handle The Device Manager handle that identifies the connection for which the context
 *                     should be loaded.
 */
static void app_context_load(dm_handle_t const * p_handle)
{
    uint32_t                 err_code;
    static uint32_t          context_data;
    dm_application_context_t context;

    context.len    = sizeof(context_data);
    context.p_data = (uint8_t *)&context_data;

    err_code = dm_application_context_get(p_handle, &context);
    if (err_code == NRF_SUCCESS)
    {
        // Send Service Changed Indication if ATT table has changed.
        if ((context_data & (DFU_APP_ATT_TABLE_CHANGED << DFU_APP_ATT_TABLE_POS)) != 0)
        {
            err_code = sd_ble_gatts_service_changed(m_conn_handle, APP_SERVICE_HANDLE_START, BLE_HANDLE_MAX);
            if ((err_code != NRF_SUCCESS) &&
                (err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&
                (err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != BLE_ERROR_NO_TX_PACKETS) &&
                (err_code != NRF_ERROR_BUSY) &&
                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
            {
                APP_ERROR_HANDLER(err_code);
            }
        }

        err_code = dm_application_context_delete(p_handle);
        APP_ERROR_CHECK(err_code);
    }
    else if (err_code == DM_NO_APP_CONTEXT)
    {
        // No context available. Ignore.
    }
    else
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/** @snippet [DFU BLE Reset prepare] */
/**@brief Function for preparing for system reset.
 *
 * @details This function implements @ref dfu_app_reset_prepare_t. It will be called by
 *          @ref dfu_app_handler.c before entering the bootloader/DFU.
 *          This allows the current running application to shut down gracefully.
 */
static void reset_prepare(void)
{
    uint32_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Disconnect from peer.
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        err_code = bsp_indication_set(BSP_INDICATE_IDLE);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // If not connected, the device will be advertising. Hence stop the advertising.
        advertising_stop();
    }

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);

    nrf_delay_ms(500);
}
/** @snippet [DFU BLE Reset prepare] */
#endif // BLE_DFU_APP_SUPPORT


/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    uint32_t       err_code;
	m_pbs.evt_handler          = NULL;
		memset(&m_pbs, 0, sizeof(m_pbs));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_attr_md.read_perm);
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_attr_md.write_perm); // Orignally no access
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_cccd_md.cccd_write_perm);
		
		// Value setting 
		//bool utc_exist_bit = false;  // bit located in m_pbs.bsc_s.flag 0x10, TBD
		m_pbs.tsc_s.small_accident_level_x = 70;
		m_pbs.tsc_s.small_accident_level_y = 60;
		m_pbs.tsc_s.medium_accident_level = 600;
		m_pbs.tsc_s.high_accident_level = 1000;
		m_pbs.tsc_s.hard_accelaration_level = 30;
		m_pbs.tsc_s.hard_braking_level = 35;
		m_pbs.tsc_s.hard_steering_level_left = 35;
		m_pbs.tsc_s.hard_steering_level_right= 35;
	
		m_pbs.bsc_s.flag = 0x00;
		m_pbs.bsc_s.sampling_frequency = 50;
		m_pbs.bsc_s.ble_output_power = -8;
		m_pbs.bsc_s.current_utc = 0;
		m_pbs.bsc_s.ambient_sensor_value = 0;
		m_pbs.bsc_s.acc_voltage = 0;

		// Event Storage Characteristic default value
		m_pbs.esc_s.download_control_point = 0x00;
		m_pbs.esc_s.number_of_event = 0x00;
		// Data Report Header Characteristic default value
		m_pbs.drhc_s.recorded_data_interval = 20;
		m_pbs.drhc_s.recorded_data_resolution = 12;
		m_pbs.drhc_s.recorded_number_of_axis = 3;
		m_pbs.drhc_s.recorded_event_id = 0;
		m_pbs.drhc_s.recorded_event_duration = 10;
		m_pbs.drhc_s.recorded_utc_of_event_start = 0;
		uint8_t default_p_sensor_data_offset[5] = {0};
		m_pbs.drhc_s.sensor_data_offset = default_p_sensor_data_offset;
		// Calibration Data Log default value
		m_pbs.cdrc_s.data_packet_id = 0;
		m_pbs.cdrc_s.data_packet_length = 18;
		uint8_t default_cdrc_data[18] = {0};
		m_pbs.cdrc_s.data_payload = default_cdrc_data;
		// Raw Data Log default value
		m_pbs.rdrc_s.data_packet_id = 0;
		m_pbs.rdrc_s.data_packet_length = 18;
		uint8_t default_rdrc_data[18] = {0};
		m_pbs.rdrc_s.data_payload = default_rdrc_data;
		
