gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
		m_pbs.bdc_s.advertising_period = 64;
		m_pbs.bdc_s.advertising_duration = 4;
		m_pbs.bdc_s.bdc_advertising_interval = 100;
		
		m_pbs.bdrc_s.advertising_time = 5;
		m_pbs.bdrc_s.bdrc_advertising_interval = 100;
		m_pbs.bdrc_s.button_status = 0;
    err_code = ble_pbs_init(&m_pbs);
    APP_ERROR_CHECK(err_code);
	
    //ble_hrs_init_t hrs_init;
//    ble_bas_init_t bas_init;
//    ble_dis_init_t dis_init;
    uint8_t        body_sensor_location;

    // Initialize Heart Rate Service.
//    body_sensor_location = BLE_HRS_BODY_SENSOR_LOCATION_FINGER;

//    memset(&hrs_init, 0, sizeof(hrs_init));

//    hrs_init.evt_handler                 = NULL;
//    hrs_init.is_sensor_contact_supported = true;
//    hrs_init.p_body_sensor_location      = &body_sensor_location;

//    // Here the sec level for the Heart Rate Service can be changed/increased.
//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&hrs_init.hrs_hrm_attr_md.cccd_write_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&hrs_init.hrs_hrm_attr_md.read_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&hrs_init.hrs_hrm_attr_md.write_perm);

//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&hrs_init.hrs_bsl_attr_md.read_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&hrs_init.hrs_bsl_attr_md.write_perm);

//    err_code = ble_hrs_init(&m_hrs, &hrs_init);
//    APP_ERROR_CHECK(err_code);

//    // Initialize Battery Service.
//    memset(&bas_init, 0, sizeof(bas_init));

//    // Here the sec level for the Battery Service can be changed/increased.
//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

//    bas_init.evt_handler          = NULL;
//    bas_init.support_notification = true;
//    bas_init.p_report_ref         = NULL;
//    bas_init.initial_batt_level   = 100;

//    err_code = ble_bas_init(&m_bas, &bas_init);
//    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
//    memset(&dis_init, 0, sizeof(dis_init));

//    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

//    err_code = ble_dis_init(&dis_init);
//    APP_ERROR_CHECK(err_code);

#ifdef BLE_DFU_APP_SUPPORT
    /** @snippet [DFU BLE Service initialization] */
    ble_dfu_init_t   dfus_init;

    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    dfus_init.evt_handler   = dfu_app_on_dfu_evt;
    dfus_init.error_handler = NULL;
    dfus_init.evt_handler   = dfu_app_on_dfu_evt;
    dfus_init.revision      = DFU_REVISION;

    err_code = ble_dfu_init(&m_dfus, &dfus_init);
    APP_ERROR_CHECK(err_code);

    dfu_app_reset_prepare_set(reset_prepare);
    dfu_app_dm_appl_instance_set(m_app_handle);
    /** @snippet [DFU BLE Service initialization] */
#endif // BLE_DFU_APP_SUPPORT
}


/**@brief Function for initializing the sensor simulators.
 */
//static void sensor_simulator_init(void)
//{
//    m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
//    m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
//    m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
//    m_battery_sim_cfg.start_at_max = true;

//    sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);

//    m_heart_rate_sim_cfg.min          = MIN_HEART_RATE;
//    m_heart_rate_sim_cfg.max          = MAX_HEART_RATE;
//    m_heart_rate_sim_cfg.incr         = HEART_RATE_INCREMENT;
//    m_heart_rate_sim_cfg.start_at_max = false;

//    sensorsim_init(&m_heart_rate_sim_state, &m_heart_rate_sim_cfg);

//    m_rr_interval_sim_cfg.min          = MIN_RR_INTERVAL;
//    m_rr_interval_sim_cfg.max          = MAX_RR_INTERVAL;
//    m_rr_interval_sim_cfg.incr         = RR_INTERVAL_INCREMENT;
//    m_rr_interval_sim_cfg.start_at_max = false;

//    sensorsim_init(&m_rr_interval_sim_state, &m_rr_interval_sim_cfg);
//}


/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
	
    err_code = app_timer_start(m_cal_data_id, CAL_DATA_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_adv_timer_id, ADVERTISING_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

//    err_code = app_timer_start(m_rr_interval_timer_id, RR_INTERVAL_INTERVAL, NULL);
//    APP_ERROR_CHECK(err_code);

//    err_code = app_timer_start(m_sensor_contact_timer_id, SENSOR_CONTACT_DETECTED_INTERVAL, NULL);
//    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
			printf("BLE_CONN_PARAMS_EVT_FAILED\r\n");
			printf("diconnect:%04X",err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    //cp_init.start_on_notify_cccd_handle    = m_hrs.hrm_handles.cccd_handle;  // BLE_GATT_HANDLE_INVALID
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

